Repository: raniamortada/flutter-projects
Catalog: lib/l10n/app_*.arb
Languages: ar

source: New Team
ar: فريق جديد

source: #ID
ar: #المعرف

source: Payments from trainees
ar: الدفعات من المتدربين

source: #Months of subscription
ar: #أشهر الاشتراك

source: Batch total
ar: إجمالي الدفعة

source: Discount
ar: الخصم

source: Tax %
ar: الضريبة %

source: Subtotal
ar: الإجمالي الجزئي

source: Total
ar: الإجمالي الكلي

# discountAmount
source: Discount
ar: الخصم

# taxAmount
source: TAX
ar: الضريبة

source: Required deposit
ar: الوديعة المطلوبة

source: Create now
ar: أنشئ الآن

# yourRegularActivityLevel
source: Your regular physical activity level?
ar: ما هو مستوى نشاطك البدني المنتظم؟

# personalizedPlanDescription
source: This helps us create your personalized plan
ar: هذا يساعدنا على إنشاء خطة مخصصة لك

# activityGoals
source: Rookie,Beginner,Intermediate,Advance,True Beast
ar: مبتدئ,مبتدئ متوسط,متوسط,متقدم,خبير

source: Start
ar: ابدأ

# addNew
source: Add a new
ar: إضافة جديدة

source: Department
ar: قسم

source: Club name
ar: اسم النادي

# clubDescription
source: Description of the club
ar: وصف النادي

source: Tournament
ar: بطولة

source: Tournament name
ar: اسم البطولة

source: Tournament description
ar: وصف البطولة

source: Tournament type
ar: نوع البطولة

source: Add trainees
ar: إضافة المتدربين

source: Add trainers
ar: إضافة المدربين

source: Tournament start date
ar: تاريخ بدء البطولة

# tournamentEndDate
source: The end of the tournament
ar: تاريخ نهاية البطولة

source: Award type
ar: نوع الجائزة

source: Championship level
ar: مستوى البطولة

# createTournament
source: Tournament created!
ar: تم إنشاء البطولة!

# cameraTapped
source: Camera icon tapped!
ar: تم النقر على أيقونة الكاميرا!

source: All
ar: جميع

source: Add
ar: إضافة

source: Products/Services
ar: المنتجات والخدمات

source: Product Type
ar: نوع المنتج

source: Product name
ar: اسم المنتج

source: Product Description
ar: وصف المنتج

source: Product price
ar: سعر المنتج

source: products
ar: المنتج

source: training
ar: تدريب

# trainingSetName
source: The name of the training set
ar: اسم مجموعة التدريب

source: Training number
ar: رقم التدريب

source: Training name
ar: اسم التدريب

source: Training description
ar: وصف التدريب

# videoLink
source: Video - link from the site
ar: رابط الفيديو - من الموقع

source: Training time
ar: وقت التدريب

# iterationsCount
source: The number of iterations
ar: عدد التكرارات

source: Adding a
ar: إضافة

source: Coach
ar: مدرب

source: Full Name
ar: الاسم الكامل

source: Username
ar: اسم المستخدم

source: Phone Number
ar: رقم الهاتف

source: Subscription Number
ar: رقم الاشتراك

# aboutEmployee
source: About the Employee
ar: عن الموظف

source: Date of Birth
ar: تاريخ الميلاد

source: Coach Status
ar: حالة المدرب

# shiftStart
source: The Beginning of the Shift
ar: بداية النوبة

source: Salary
ar: الراتب

source: Gender
ar: الجنس

source: Coaches
ar: المدربين

# defaultId
source: Unknown ID
ar: رقم غير معروف

# defaultName
source: Unknown Department
ar: قسم غير معروف

# defaultDescription
source: No description available
ar: لا يوجد وصف

source: Adding
ar: إضافة

# diet
source: a diet
ar: نظام غذائي

source: Diet ID
ar: رقم النظام الغذائي

source: Meal Rating
ar: تقييم الوجبة

# dietName
source: Name of the Diet
ar: اسم النظام الغذائي

# dietDescription
source: Description of the Diet
ar: وصف النظام الغذائي

# dietComponents
source: Components of the Diet
ar: مكونات النظام الغذائي

# dietStartTime
source: Beginning of the Diet Time
ar: بداية وقت النظام الغذائي

# dietEndTime
source: Diet Time is Over
ar: انتهاء وقت النظام الغذائي

# createNowTapped
source: Create Now button tapped!
ar: تم النقر على زر إنشاء الآن!

source: Adding an
ar: إضافة

source: employee
ar: موظف

source: National Number
ar: الرقم الوطني

source: Section
ar: القسم

source: Comprehensive overview
ar: نظرة شاملة

source: Country
ar: البلد

source: State
ar: الولاية

source: Adding a
ar: إضافة

source: trainer
ar: المدرب

source: Full Name
ar: الاسم الكامل

source: Phone Number
ar: رقم الهاتف

source: #Subscription number
ar: رقم الاشتراك

source: Email
ar: البريد الإلكتروني

source: About the Trainer
ar: عن المدرب

source: Date of Birth
ar: تاريخ الميلاد

source: Subtype
ar: النوع الفرعي

# monthly_subscription_value
source: The Monthly Subscription Value
ar: قيمة الاشتراك الشهري

source: Total Subscription Value
ar: إجمالي قيمة الاشتراك

source: Height
ar: الطول

source: Weight
ar: الوزن

source: Professional Degree
ar: الدرجة المهنية

source: Nationality
ar: الجنسية

source: Address
ar: العنوان

source: Governorate
ar: المحافظة

source: Postal Code
ar: الرمز البريدي

source: Website
ar: الموقع الإلكتروني

source: Facebook
ar: فيسبوك

source: Twitter
ar: تويتر

source: Instagram
ar: إنستغرام

source: YouTube
ar: يوتيوب

source: HOW OLD ARE YOU ?
ar: كم عمرك؟

source: THIS HELPS US CREATE YOUR PERSONALIZED PLAN
ar: هذا يساعدنا في إنشاء خطة مخصصة لك

source: Next
ar: التالي

# forgotPasswordTitle
source: FORGOT PASSWORD?
ar: هل نسيت كلمة المرور؟

# forgotPasswordSubtitle
source: ENTER YOUR INFORMATION BELOW OR LOGIN WITH ANOTHER ACCOUNT
ar: أدخل معلوماتك أدناه أو قم بتسجيل الدخول بحساب آخر

source: Try another way
ar: جرب طريقة أخرى

source: Send
ar: إرسال

source: WELCOME BACK
ar: أهلاً بعودتك

source: Password
ar: كلمة المرور

source: Forgot Password
ar: هل نسيت كلمة المرور؟

# noAccount
source: Didn't have any account?
ar: لا تملك حساباً؟

source: Sign Up here
ar: إنشاء حساب هنا

source: Sign in
ar: تسجيل الدخول

source: Verification
ar: التحقق

# checkEmail
source: Check your email. We’ve sent you the PIN at your email.
ar: تحقق من بريدك الإلكتروني. لقد أرسلنا لك الرقم السري على بريدك الإلكتروني.

# didYouReceiveCode
source: Did you receive any code?
ar: هل تلقيت أي رمز؟

source: Verify
ar: تحقق

# allChampionship
source: All Championships
ar: جميع البطولات

source: championship
ar: البطولة

source: Results
ar: النتائج

source: Player Name
ar: اسم اللاعب

source: Player Score
ar: نتيجة اللاعب

source: Performance Evaluation
ar: تقييم الأداء

source: Details
ar: التفاصيل

source: Team
ar: الفريق

source: Name
ar: الاسم

source: Description
ar: الوصف

source: Stella
ar: ستيلا

source: Diet Plan
ar: خطة النظام الغذائي

source: Breakfast
ar: الإفطار

source: Lunch
ar: الغداء

source: Dinner
ar: العشاء

source: FITNESS TRAINERS
ar: مدربو اللياقة البدنية

source: TELL US ABOUT YOURSELF!
ar: أخبرنا عن نفسك!

# knowYourGender
source: TO GIVE YOU A BETTER EXPERIENCE WE NEED TO KNOW YOUR GENDER
ar: لتحسين تجربتك، نحتاج إلى معرفة جنسك

source: Male
ar: ذكر

source: Female
ar: أنثى

# selectGender
source: Please select your gender first!
ar: يرجى اختيار جنسك أولاً!

# yourGoal
source: What’s your goal?
ar: ما هو هدفك؟

# personalizedPlan
source: This helps us create your personalized plan
ar: سيساعدنا هذا في إنشاء خطتك الشخصية

# yourHeight
source: What’s your height?
ar: ما هو طولك؟

source: HELLO SARAH,
ar: مرحبًا سارة،

source: Good morning.
ar: صباح الخير.

source: Today Workout Plan
ar: خطة التمارين اليوم

source: Workout Categories
ar: فئات التمارين

source: See All
ar: عرض الكل

source: New Workouts
ar: تمارين جديدة

source: Beginner
ar: مبتدئ

source: Intermediate
ar: متوسط

source: Advance
ar: متقدم

source: Wake Up Call
ar: نداء الاستيقاظ

source: Full Body Goal Crusher
ar: تمرين كامل للجسم

source: Lower Body Strength
ar: تمارين تقوية الجزء السفلي

source: Workouts for Beginner
ar: تمارين للمبتدئين

source: Select Date
ar: اختر التاريخ

source: Active Calories
ar: السعرات الحرارية النشطة

source: Steps
ar: الخطوات

source: Time
ar: الوقت

source: Heart
ar: القلب

source: Stability Training
ar: تدريب الاستقرار

source: Flash Cycling
ar: الدراجات السريعة

source: Modify club
ar: تعديل النادي

source: settings
ar: الإعدادات

# commercialRegistration
source: Commercial registration number
ar: رقم السجل التجاري

source: All Team
ar: جميع الفريق

source: Name Department
ar: اسم القسم

source: Team Name
ar: اسم الفريق

source: Team Description
ar: وصف الفريق

source: Team Coach
ar: مدرب الفريق

source: Team Members
ar: أعضاء الفريق

source: NOTIFICATIONS
ar: الإشعارات

source: Workout Reminders
ar: تذكيرات التمرين

source: Program Notifications
ar: إشعارات البرنامج

source: Phone Settings
ar: إعدادات الهاتف

# notificationPermissionText
source: You can manage your app notification permission in your
ar: يمكنك إدارة إذن إشعارات التطبيق في

source: Today
ar: اليوم

source: This Week
ar: هذا الأسبوع

source: Meal Time
ar: وقت الوجبة

# mealTimeSubtitle
source: Time to eat your breakfast
ar: حان وقت تناول فطورك

source: Jogging
ar: الجري

# joggingSubtitle
source: It's time for your jogging session
ar: حان وقت الجري

source: Yoga Session
ar: جلسة اليوغا

# yogaSessionSubtitle
source: Get ready for your Yoga routine
ar: استعد لروتين اليوغا

source: Aerobics
ar: الأيروبكس

# aerobicsSubtitle
source: It's time for aerobics
ar: حان وقت الأيروبكس

source: Full Body Workout
ar: تمرين كامل للجسم

source: Daily Push Up
ar: تمرين ضغط يومي

source: New
ar: الجديد

source: Events
ar: الأحداث

source: Congratulations
ar: تهانينا

# dailyChallenge
source: 35% your daily challenge completed
ar: 35% من التحدي اليومي تم إنجازه

source: Attention
ar: تنبيه

# subscriptionExpire
source: Your subscription is going to expire very soon. Subscribe now.
ar: اشتراكك سينتهي قريبًا. اشترك الآن.

# dailyActivity
source: Time for your workout session
ar: حان وقت جلسة التمرين

# writeReview
source: WRITE A REVIEW
ar: اكتب مراجعة

source: Rating
ar: التقييم

# reviewHint
source: Review (Optional)
ar: المراجعة (اختياري)

# dayTitle
source: Day 01 - Warm Up
ar: اليوم 01 - الإحماء

# schedule
source: 60 min
ar: 60 دقيقة

# calories
source: 350 Cal
ar: 350 كالوري

# simpleWarmUp
source: Simple Warm-Up Exercises
ar: تمارين الإحماء البسيطة

source: Start Workout
ar: ابدأ التمرين

source: Meal Categories
ar: فئات الوجبات

# defineUserAttribute
source: Define the user attribute
ar: حدد سمة المستخدم

# betterExperienceMessage
source: To give you a better experience we need We want to know who you are
ar: لنقدم لك تجربة أفضل، نحتاج نريد أن نعرف من أنت

source: Admin
ar: مدير

source: Player
ar: لاعب

source: What's your weight?
ar: ما وزنك؟

# changeLater
source: You can always change this later
ar: يمكنك تغييره لاحقًا

source: UNITS OF MEASURE
ar: وحدات القياس

source: Metric
ar: متري

source: Imperial
ar: إمبراطوري

# selectSubscriptionMethod
source: Select the desired subscription method
ar: اختر طريقة الاشتراك المطلوبة

source: Annual single
ar: سنوي واحد

source: Monthly single
ar: شهري واحد

# sevenDaysFreeTrial
source: 7 days free trial
ar: 7 أيام تجربة مجانية

# gymMonthly
source: I’m Gym Monthly
ar: اشتراك شهري

# gymAnnual
source: I’m Gym Annual
ar: اشتراك سنوي

source: Single subscription
ar: اشتراك فردي

source: SYSTEM GYM
ar: نظام الجيم

source: your email
ar: بريدك الإلكتروني

source: Subscription period
ar: فترة الاشتراك

source: If you have an account?
ar: إذا كان لديك حساب؟

source: Language
ar: اللغة

source: Contact Us
ar: اتصل بنا

source: Sessions
ar: الجلسات

source: Your training today
ar: تدريباتك اليوم

source: Trainers
ar: المدربون

source: Videos
ar: الفيديوهات

source: Tutorials
ar: الدروس

source: REVIEWS
ar: التقييمات

# ratings
source: {rating} Ratings
ar: تقييمات

source: Recent
ar: الأحدث

source: Critical
ar: الحرجة

source: Favourable
ar: الإيجابية

source: Edit Profile
ar: تعديل الملف الشخصي

source: Privacy Policy
ar: سياسة الخصوصية

source: Joined
ar: انضم منذ

# monthsAgo
source: month ago
ar: شهر

source: Upgrade to Premium
ar: ترقية إلى النسخة المدفوعة

source: This subscription is auto-renewable
ar: هذه الاشتراك قابل للتجديد التلقائي

source: Sign Out
ar: تسجيل الخروج

source: PRO
ar: محترف

source: Sports club management
ar: إدارة الأندية الرياضية

source: It's
ar: إنه

source: easier
ar: أسهل

source: Manage players
ar: إدارة اللاعبين

source: one place
ar: مكان واحد

source: All exercises are
ar: جميع التمارين هي

source: illustrated
ar: مُوضحة

source: Professionally
ar: باحتراف

source: Welcome to
ar: مرحبًا بك في

source: Achieve your body goals with us
ar: حقق أهداف جسمك معنا

source: Get Started
ar: ابدأ الآن

source: All products
ar: جميع المنتجات

source: All coaches
ar: جميع المدربين

source: Categories
ar: الفئات

source: Trending
ar: الرائج

source: Discover
ar: اكتشف

# helloUser
source: Hello
ar: مرحباً

# startYourDay
source: Let's start your day
ar: لنبدأ يومك

source: Sell all
ar: بيع الكل

source: Functional Strength
ar: القوة الوظيفية

source: Experience
ar: الخبرة

source: Completed
ar: المنجز

source: Active Clients
ar: العملاء النشطين

source: Read all reviews
ar: قراءة جميع التعليقات

# bookAppointment
source: Book an Appointment
ar: حجز موعد

source: Hello
ar: مرحبًا

# manageYourClub
source: Manage your club today!
ar: إدارة ناديك اليوم!

source: training section
ar: قسم التدريب

source: Logo Club
ar: نادي اللياقة البدنية

source: Add products
ar: إضافة منتجات

# addSection
source: Add a section
ar: إضافة قسم

# addCoach
source: Add a coach
ar: إضافة مدرب

# addPlayer
source: Add a player
ar: إضافة لاعب

# addEmployee
source: Add an employee
ar: إضافة موظف

source: Add diet
ar: إضافة نظام غذائي

source: Add training
ar: إضافة تدريب

# addTeam
source: Add a team
ar: إضافة فريق

# addChampionship
source: Add a championship
ar: إضافة بطولة

source: Accounting system
ar: النظام المحاسبي
